---
type: BuildingPadType
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# BuildingPadType

`Autodesk.Revit.DB.BuildingPadType` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateDefault | — | `public static BuildingPadType CreateDefault ( Document document )` |
| Property | Parameter | — | `` |
| Property | ThermalProperties | 2013 | `public ThermalProperties ThermalProperties { get ; }` |